docs/blog/20200406.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Roadmap for Carbs</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cem Keylan">
<link rel="stylesheet" type="text/css" href="/style.css">
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar">
    <a href="/" class=navbartitle>Carbs Linux</a>

    <label for="hamburger">&#9776;</label>
    <input type="checkbox" id="hamburger" />
    <ul id=navbarlist>
        <li><a href="/" title="Home Page">Home</a></li>
        <li><a href="//git.carbslinux.org" title="Git Repository">Git</a></li>
        <li><a href="/download.html" title="Download Carbs Linux">Download</a></li>
        <li><a href="/blog" title="Blog Posts">Blog</a></li>
        <li><a href="/install.html" title="Installation Instructions">Installation</a></li>
        <li><a href="/docs.html" title="Documentation">Docs</a></li>
    </ul>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Roadmap for Carbs</h1>
<p class="subtitle">posted on 2020-04-06</p>
</header><p>
It has been a busy week. There are lots of changes in direction, and more to
come. I want to talk a little about all of them.
</p>

<div id="outline-container-orgb0c7d87" class="outline-2">
<h2 id="orgb0c7d87">Carbs Linux Server Going Down</h2>
<div class="outline-text-2" id="text-orgb0c7d87">
<p>
It became harder to maintain and pay for the server, and I will be shutting it
down in May. I am currently in the phase of carrying over everything to <a href="https://github.com/CarbsLinux">Github</a>.
The repository and the website is served on Github now. I have also moved the
<a href="https://github.com/CarbsLinux/wiki/wiki">Wiki</a> to Github and anyone can edit it there. There are some outdated posts that
I will be fixing around this week.
</p>

<p>
I am not quite sure where to store the downloads page now. But I will be
switching that to a new source as well. (Maybe SourceHut?)
</p>

<p>
I feel a little sad for switching, but serving on Github is faster, cheaper, and
hassle-free.
</p>
</div>
</div>

<div id="outline-container-orgc2bcab5" class="outline-2">
<h2 id="orgc2bcab5">Forking KISS</h2>
<div class="outline-text-2" id="text-orgc2bcab5">
<p>
I had a personal fork of KISS, which I enjoyed thoroughly. I didn't intend to
make it the default when I started it, but it has matured enough to be so. The
package manager can now be found on <a href="https://github.com/CarbsLinux/kiss">this repository</a>. See it for the added
changes.
</p>

<p>
This will be a change for the better, as I can develop the package manager as it
fits my views.
</p>
</div>
</div>

<div id="outline-container-org0538658" class="outline-2">
<h2 id="org0538658">Small Changes on the Website</h2>
<div class="outline-text-2" id="text-org0538658">
<p>
I have made some small changes on the website. The build is not dependent on
Plan9 utilities anymore. It was fun messing around with <code>rc</code> and <code>mk</code>, but they
are quite limited compared to POSIX shell.
</p>

<p>
RSS feeds are finally working as intended, both for the <a href="https://carbslinux.org/news.xml">news</a> section, and the
<a href="https://carbslinux.org/rss.xml">blog</a> section.
</p>

<p>
You can see every page's <code>.txt</code> output at the end of the page by clicking 'View
Page Source'. Meanwhile, I will be updating some pages to be a little more
'human-readable'.
</p>
</div>
</div>

<div id="outline-container-orge097249" class="outline-2">
<h2 id="orge097249">Outsources Repository</h2>
<div class="outline-text-2" id="text-orge097249">
<p>
I have opened an <code>outsource</code> repository, which I will be pushing this week. I
will add a new post when I am ready to push it. I think it will be interesting,
it will also make more sense about the changes I have added to the package
manager. The now empty repository, can be found <a href="https://github.com/CarbsLinux/outsource">here</a>!
</p>
</div>
</div>

<div id="outline-container-org80536a3" class="outline-2">
<h2 id="org80536a3">New Tarball</h2>
<div class="outline-text-2" id="text-org80536a3">
<p>
Finally, I have released a new tarball today, which can be obtained from the
<a href="https://dl.carbslinux.org/releases">downloads page</a>.
</p>

<p>
I am planning to add more of these update posts as I'm feeling better about the
website structure overall.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
    <p>Linux&reg; is a registered trademark of Linus Torvalds</p>
    <p>Copyright &copy; 2019-2021 Cem Keylan</p>
</footer>
</div>
</body>
</html>
